# GetStoryChoiceStrsN

## Description
Gets story bound strings to supply to the bound popup. Can request strings for top bound, bottom bound, or dual (both) bounds.

```pascal
PROCEDURE GetStoryChoiceStrsN(
				story          : HANDLE;
				VAR strings    : ARRAY;
				boundSelection : INTEGER);
```

```python
def vs.GetStoryChoiceStrsN(story, boundSelection):
    return strings
```

## Parameters
|Name|Type|Description|
|---|---|---|
|story|HANDLE|The story relative to which to get the strings. Nil gets a generic list of strings.|
|strings|ARRAY|Returns the strings.|
|boundSelection|INTEGER|Type of bounds strings being requested: 0 for Top Bound; 1 for Dual Bound (combines both top and bottom); 2 for Bottom Bound.|

## Version
Availability: from Vectorworks 2017

## Category
* Dialogs - Modern